Tekla.Structures.DirectManipulation.Adapter.SelectorHandler
The Tekla.Structures.DirectManipulation.Adapter.SelectorHandler class handles the selector.

Tekla.Structures.DirectManipulation.Adapter.SelectorHandler.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.SelectorHandler class.

Tekla.Structures.DirectManipulation.Adapter.SelectorHandler.SelectionChanged
Occurs when the selection has been changed.

Tekla.Structures.DirectManipulation.Adapter.SelectorHandler.GetSelectedObjects
Gets selected objects.
Returns: The selected objects.

Tekla.Structures.DirectManipulation.Adapter.SelectorHandler.OnSelectionChanged(System.String)
Called when the selection has been changed.
parameter: The parameter.